online-workshops/python-14-Sep-2013/python-14-sep-2013.org
#+TITLE: Online Python workshop (14/Sep)
#+AUTHOR: Noufal Ibrahim <noufal@thelycaeum.in>
#+EMAIL: noufal@thelycaeum.in
#+STYLE: <link rel="stylesheet" type="text/css" href="stylesheet.css" />
* Introduction
  We are going to create a simple Python application to download the
  latest image from National Geographics [[http://photography.nationalgeographic.com/photography/photo-of-the-day/][Photo of the day]] and set it
  as your wallpaper.

* Step 0 : System requirements
  We're assuming that you're going to doing this whole thing on a
  modern Gnu/Linux platform. It's possible to do it on Windows as well
  but the setup instructions will be different and our time is
  limited.

* Step 1 : Install required software
  - First thing is to make sure Python is installed. This is usually
    the case on modern Gnu/Linux distributions. Otherwise, you can
    install it using your package manager. On Ubuntu/Debian, the
    package is called =python-minimal= so =sudo apt-get install
    python-minimal= will take care of it.
  - Second thing is to install =[[http://www.virtualenv.org/en/latest/][virtualenv]]= and =[[http://virtualenvwrapper.readthedocs.org/en/latest/][virtualenvwrapper]]=. To
    get this on Ubuntu/Debian, you can use =sudo apt-get install
    virtualenvwrapper=.
  - To check this, you can try typing =python= and hitting enter. You
    should get a message like so

#+BEGIN_SRC python
  noufal@sanitarium% python
  python
  Python 2.7.3 (default, Jan  2 2013, 13:56:14) 
  [GCC 4.7.2] on linux2
  Type "help", "copyright", "credits" or "license" for more information.
  >>> 
#+END_SRC

  [[http://python.org][Python]] is a high level general purpose cross platform programming
  language. It's available by default on most modern Gnu/Linux
  distributions.
  
  The Python distribution comes with the interpreter itself which is
  usually at =/usr/bin/python= and with a "standard library". This
  gives you a lot of routines which you can use for your
  work. e.g. functions to parse command line arguments, talk to mail
  servers, talk to web servers, interact with the underlying
  operating system, high performance implementations of data
  structures like queues and heaps etc. The standard library exists
  =/usr/lib/python-2.7= (for the 2.7 version of Python which is the
  default on my system).
  
  Third party packages (i.e. libraries that do useful things which
  are not part of the python standard library) can be installed in
  two ways. 
  
  1. You can install them inside =/usr/lib/python-2.7=. This has a
     number of problems. 
     - Firstly, you pollute the tested, maintained
       standard lib with a lot of non standard stuff that can break
       things in mysterious ways.
     - Secondly, If you're working on /n/ separate projects, you
       can't have different libraries for each one of them. All
       will rely on the same libraries from the system path.
     - You can't uninstall libraries without a lot of book keeping.
     - You can't install anything without system administrator
       privileges.
  2. The second way is to create a small isolated environment
     somewhere inside your own home directory into which you can
     install 3rd party packages and use that. This is what
     =virtualenv= does for you. It lets you create small environments
     which you can use for single projects. We're going to do that
     now. =virtualenvwrapper= is a utility built on top of
     =virtualenvwrapper= that makes it convenient for you to create,
     manage and destroy =virtualenvs=.

  We also need a program that can set the background. This depends on
  your system but the =qiv= program that's there on Ubuntu/Debian
  will work for most desktop environments. You can install it using
  =sudo apt-get install qiv=.

