online-workshops/python-14-Sep-2013/python-14-sep-2013.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Online Python workshop (14/Sep)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-14 18:55:16 IST"/>
<meta name="author" content="Noufal Ibrahim <noufal@thelycaeum.in>"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="stylesheet.css" />

</head>
<body>
<div id="content">

<h1 class="title">Online Python workshop (14/Sep)</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a></li>
<li><a href="#sec-2">2 Step 0 : System requirements </a></li>
<li><a href="#sec-3">3 Step 1 : Install required software </a></li>
<li><a href="#sec-4">4 Step 2 : Setup our environment </a></li>
<li><a href="#sec-5">5 Step 3 : Basic program </a>
<ul>
<li><a href="#sec-5_1">5.1 Step 3.1 : Fetch the page </a>
<ul>
<li><a href="#sec-5_1_1">5.1.1 Explanations </a></li>
</ul>
</li>
<li><a href="#sec-5_2">5.2 Step 3.2 : Parse the document. </a>
<ul>
<li><a href="#sec-5_2_1">5.2.1 Explanation </a></li>
</ul>
</li>
<li><a href="#sec-5_3">5.3 Step 3.3 : Get the image. </a>
<ul>
<li><a href="#sec-5_3_1">5.3.1 Explanation </a></li>
</ul>
</li>
<li><a href="#sec-5_4">5.4 Step 3.4 : Set the background </a>
<ul>
<li><a href="#sec-5_4_1">5.4.1 Explanation </a></li>
</ul>
</li>
<li><a href="#sec-5_5">5.5 Step 3.5 : Add a main function. </a>
<ul>
<li><a href="#sec-5_5_1">5.5.1 Explanation </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 Enhancement 1 : Add code to get previous images </a></li>
<li><a href="#sec-7">7 Enhancement 2 : Add command line arguments </a>
<ul>
<li><a href="#sec-7_1">7.1 Explanation </a></li>
</ul>
</li>
<li><a href="#sec-8">8 Homework </a>
<ul>
<li><a href="#sec-8_1">8.1 Homework 1 </a></li>
<li><a href="#sec-8_2">8.2 Homework 2 </a></li>
<li><a href="#sec-8_3">8.3 Homework 3 </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Class transcript </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction </h2>
<div class="outline-text-2" id="text-1">

<p>  We are going to create a simple Python application to download the
  latest image from National Geographics <a href="http://photography.nationalgeographic.com/photography/photo-of-the-day/">Photo of the day</a> and set it
  as your wallpaper.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Step 0 : System requirements </h2>
<div class="outline-text-2" id="text-2">

<p>  We're assuming that you're going to doing this whole thing on a
  modern Gnu/Linux platform. It's possible to do it on Windows as well
  but the setup instructions will be different and our time is
  limited.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Step 1 : Install required software </h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>First thing is to make sure Python is installed. This is usually
    the case on modern Gnu/Linux distributions. Otherwise, you can
    install it using your package manager. On Ubuntu/Debian, the
    package is called <code>python-minimal</code> so <code>sudo apt-get install     python-minimal</code> will take care of it.
</li>
<li>Second thing is to install =<a href="http://www.virtualenv.org/en/latest/">virtualenv</a>= and =<a href="http://virtualenvwrapper.readthedocs.org/en/latest/">virtualenvwrapper</a>=. To
    get this on Ubuntu/Debian, you can use <code>sudo apt-get install     virtualenvwrapper</code>.
</li>
<li>To check this, you can try typing <code>python</code> and hitting enter. You
    should get a message like so




<pre class="src src-python">noufal@sanitarium% python
python
Python 2.7.3 (default, Jan  2 2013, 13:56:14) 
[GCC 4.7.2] on linux2
Type <span style="color: #ffa07a;">"help"</span>, <span style="color: #ffa07a;">"copyright"</span>, <span style="color: #ffa07a;">"credits"</span> <span style="color: #00ffff;">or</span> <span style="color: #ffa07a;">"license"</span> <span style="color: #00ffff;">for</span> more information.
&gt;&gt;&gt; 
</pre>


</li>
</ul>

<p>
  <a href="http://python.org">Python</a> is a high level general purpose cross platform programming
  language. It's available by default on most modern Gnu/Linux
  distributions.
</p>
<p>  
  The Python distribution comes with the interpreter itself which is
  usually at <code>/usr/bin/python</code> and with a "standard library". This
  gives you a lot of routines which you can use for your
  work. e.g. functions to parse command line arguments, talk to mail
  servers, talk to web servers, interact with the underlying
  operating system, high performance implementations of data
  structures like queues and heaps etc. The standard library exists
  <code>/usr/lib/python-2.7</code> (for the 2.7 version of Python which is the
  default on my system).
</p>
<p>  
  Third party packages (i.e. libraries that do useful things which
  are not part of the python standard library) can be installed in
  two ways. 
</p>
<ol>
<li>You can install them inside <code>/usr/lib/python-2.7</code>. This has a
     number of problems. 
<ul>
<li>Firstly, you pollute the tested, maintained
       standard lib with a lot of non standard stuff that can break
       things in mysterious ways.
</li>
<li>Secondly, If you're working on <i>n</i> separate projects, you
       can't have different libraries for each one of them. All
       will rely on the same libraries from the system path.
</li>
<li>You can't uninstall libraries without a lot of book keeping.
</li>
<li>You can't install anything without system administrator
       privileges.
</li>
</ul>
</li>
<li>The second way is to create a small isolated environment
     somewhere inside your own home directory into which you can
     install 3rd party packages and use that. This is what
     <code>virtualenv</code> does for you. It lets you create small environments
     which you can use for single projects. We're going to do that
     now. <code>virtualenvwrapper</code> is a utility built on top of
     <code>virtualenvwrapper</code> that makes it convenient for you to create,
     manage and destroy <code>virtualenvs</code>.
</li>
</ol>

<p>
  We also need a program that can set the background. This depends on
  your system but the <code>qiv</code> program that's there on Ubuntu/Debian
  will work for most desktop environments. You can install it using
  <code>sudo apt-get install qiv</code>.
</p>
</div>

</div>
