online-workshops/python-14-Sep-2013/python-14-sep-2013.org
* Step 2 : Setup our environment
  - First thing is to create a =virtualenv= for our project. You can
    do this like so

#+BEGIN_SRC shell-script
  guest@sanitarium:~$ . /etc/bash_completion.d/virtualenvwrapper 
  guest@sanitarium:~$ mkvirtualenv natgeo
  New python executable in natgeo/bin/python
  Installing distribute.............................................................................................................................................................................................done.
  Installing pip...............done.
  virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/predeactivate
  virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/postdeactivate
  virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/preactivate
  virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/postactivate
  virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/get_env_details
  (natgeo)guest@sanitarium:~$ 
#+END_SRC

  The first =. /etc/bash_completion.d/virtualenvwrapper= line sources
  the virtualenvwrapper helper functions so that you have the
  =mkvirtualenv= command available. 

  Then create a virtualenv using =mkvirtualenv=. It will create it and
  then switch you to using it. You can see that it's activated in your
  prompt. Look at the =natgeo= in the prompt. 

  You can get out the virtualenv using =deactivate=. You can delete
  the virtualenv if you no longer want it using =rmvirtualenv=.

  - The next thing we need to do is to install some extra libraries.
    1. [[http://docs.python-requests.org/en/latest/][Requests]] - Requests is an HTTP client library which you can use
       to fetch pages from the net. There is a module called =urllib=
       in the standard library but it's very hard to work
       with. Requests is much cleaner and pretty much the way to go
       these days. We'll be using to fetch the Picture of the Day page
       from the National Geographic website.
    2. [[http://www.crummy.com/software/BeautifulSoup/][Beautiful Soup]] - This is a very nice library to parse HTML
       code. It can handle bad HTML and is powerful enough to handle
       very complicated searches inside messy HTML documents. We're
       installing something called =beautifulsoup4= which is the
       latest version of the library. We'll be using this this to
       parse the HTML which we fetch from the National Geographic
       website.
  - You can install these using =pip install requests= and 
    =pip install beautifulsoup4=. Do this inside the virtualenv and
    you'll see something like this.

#+BEGIN_SRC shell-script
(natgeo)guest@sanitarium:~/project$ pip install BeautifulSoup4
Downloading/unpacking BeautifulSoup4
  Downloading beautifulsoup4-4.3.1.tar.gz (142Kb): 142Kb downloaded
  Running setup.py egg_info for package BeautifulSoup4
    
Installing collected packages: BeautifulSoup4
  Running setup.py install for BeautifulSoup4
    
Successfully installed BeautifulSoup4
Cleaning up...

(natgeo)guest@sanitarium:~$ pip install requests
Downloading/unpacking requests
  Downloading requests-1.2.3.tar.gz (348Kb): 348Kb downloaded
  Running setup.py egg_info for package requests
    
Installing collected packages: requests
  Running setup.py install for requests
    
Successfully installed requests
Cleaning up...
(natgeo)guest@sanitarium:~$ 
#+END_SRC
 
  Once this is done, you should be able to check if the libraries have
  been installed like so

#+BEGIN_SRC python
(natgeo)guest@sanitarium:~$ python
Python 2.7.3 (default, Jan  2 2013, 13:56:14) 
[GCC 4.7.2] on linux2
Type "help", "copyright", "credits" or "license" for more information.
>>> import requests
>>> import bs4
>>> 
#+END_SRC

  They should import without any errors. Once you have this much
  working, you're good to go. 

* Step 3 : Basic program
** Step 3.1 : Fetch the page
   
   Let's write a simple function to just fetch the page and return the
   HTML. Put the following code into a program called =ng_pod.py= (for
   National Geographic Picture of the day).

#+BEGIN_SRC python
import requests

def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

#+END_SRC 

   To run this, Launch the interpreter and =import= this file. Then
   run the =fetch_url= function. You should get something like this

#+BEGIN_SRC python
(natgeo)guest@sanitarium:~/project$ python
Python 2.7.3 (default, Jan  2 2013, 13:56:14) 
[GCC 4.7.2] on linux2
Type "help", "copyright", "credits" or "license" for more information.
>>> import ng_pod
>>> body = ng_pod.fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")
>>> print body
.
.
.
#+END_SRC

   There will be a lot of output.

   This is fine but it would be nicer to directly run it from the
   command line rather than importing and manually running from the
   interpreter. If we do that however, we get no output. Try it
   =python ng_pod.py=. This is because the function is not actually
   called. We can fix that by sticking an invocation at the end like
   so

#+BEGIN_SRC python
import requests

def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")

#+END_SRC 

   Now it will work fine but we can no longer import it without the
   fetch running which is annoying. To resolve this, the standard
   Python idiom is to have different behaviours when the module is
   imported and when it is run.

#+BEGIN_SRC python
import requests

def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

if __name__ == "__main__":
    print fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")

#+END_SRC 

  Python modules when imported will have a special variable
  automatically created called =__name__=. If the module was imported,
  this will have the name of module in it. If it was run, it will be
  =__main__=. We put a check for this and if imported, run the
  function.

  Now, if we run the module, it will actually do the fetching. If we
  import it, it won't do anything and will wait for us to call the
  function.
  
