online-workshops/python-14-Sep-2013/python-14-sep-2013.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Step 2 : Setup our environment </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>First thing is to create a <code>virtualenv</code> for our project. You can
    do this like so




<pre class="src src-shell-script">guest@sanitarium:~$ . /etc/bash_completion.d/virtualenvwrapper 
guest@sanitarium:~$ mkvirtualenv natgeo
New python executable<span style="color: #00ffff;"> in</span> natgeo/bin/python
Installing distribute.............................................................................................................................................................................................done.
Installing pip...............done.
virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/predeactivate
virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/postdeactivate
virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/preactivate
virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/postactivate
virtualenvwrapper.user_scripts creating /home/guest/.virtualenvs/natgeo/bin/get_env_details
(natgeo)guest@sanitarium:~$ 
</pre>


</li>
</ul>

<p>
  The first <code>. /etc/bash_completion.d/virtualenvwrapper</code> line sources
  the virtualenvwrapper helper functions so that you have the
  <code>mkvirtualenv</code> command available. 
</p>
<p>
  Then create a virtualenv using <code>mkvirtualenv</code>. It will create it and
  then switch you to using it. You can see that it's activated in your
  prompt. Look at the <code>natgeo</code> in the prompt. 
</p>
<p>
  You can get out the virtualenv using <code>deactivate</code>. You can delete
  the virtualenv if you no longer want it using <code>rmvirtualenv</code>.
</p>
<ul>
<li>The next thing we need to do is to install some extra libraries.
<ol>
<li><a href="http://docs.python-requests.org/en/latest/">Requests</a> - Requests is an HTTP client library which you can use
       to fetch pages from the net. There is a module called <code>urllib</code>
       in the standard library but it's very hard to work
       with. Requests is much cleaner and pretty much the way to go
       these days. We'll be using to fetch the Picture of the Day page
       from the National Geographic website.
</li>
<li><a href="http://www.crummy.com/software/BeautifulSoup/">Beautiful Soup</a> - This is a very nice library to parse HTML
       code. It can handle bad HTML and is powerful enough to handle
       very complicated searches inside messy HTML documents. We're
       installing something called <code>beautifulsoup4</code> which is the
       latest version of the library. We'll be using this this to
       parse the HTML which we fetch from the National Geographic
       website.
</li>
</ol>
</li>
<li>You can install these using <code>pip install requests</code> and 
    <code>pip install beautifulsoup4</code>. Do this inside the virtualenv and
    you'll see something like this.




<pre class="src src-shell-script">(natgeo)guest@sanitarium:~/project$ pip install BeautifulSoup4
Downloading/unpacking BeautifulSoup4
  Downloading beautifulsoup4-4.3.1.tar.gz (142Kb): 142Kb downloaded
  Running setup.py egg_info for package BeautifulSoup4
    
Installing collected packages: BeautifulSoup4
  Running setup.py install for BeautifulSoup4
    
Successfully installed BeautifulSoup4
Cleaning up...

(natgeo)guest@sanitarium:~$ pip install requests
Downloading/unpacking requests
  Downloading requests-1.2.3.tar.gz (348Kb): 348Kb downloaded
  Running setup.py egg_info for package requests
    
Installing collected packages: requests
  Running setup.py install for requests
    
Successfully installed requests
Cleaning up...
(natgeo)guest@sanitarium:~$ 
</pre>


</li>
</ul>

<p> 
  Once this is done, you should be able to check if the libraries have
  been installed like so
</p>



<pre class="src src-python">(natgeo)guest@sanitarium:~$ python
Python 2.7.3 (default, Jan  2 2013, 13:56:14) 
[GCC 4.7.2] on linux2
Type <span style="color: #ffa07a;">"help"</span>, <span style="color: #ffa07a;">"copyright"</span>, <span style="color: #ffa07a;">"credits"</span> <span style="color: #00ffff;">or</span> <span style="color: #ffa07a;">"license"</span> <span style="color: #00ffff;">for</span> more information.
&gt;&gt;&gt; <span style="color: #00ffff;">import</span> requests
&gt;&gt;&gt; <span style="color: #00ffff;">import</span> bs4
&gt;&gt;&gt; 
</pre>



<p>
  They should import without any errors. Once you have this much
  working, you're good to go. 
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Step 3 : Basic program </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> Step 3.1 : Fetch the page </h3>
<div class="outline-text-3" id="text-5_1">


<p>   
   Let's write a simple function to just fetch the page and return the
   HTML. Put the following code into a program called <code>ng_pod.py</code> (for
   National Geographic Picture of the day).
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> requests

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

</pre>



<p>
   To run this, Launch the interpreter and <code>import</code> this file. Then
   run the <code>fetch_url</code> function. You should get something like this
</p>



<pre class="src src-python">(natgeo)guest@sanitarium:~/project$ python
Python 2.7.3 (default, Jan  2 2013, 13:56:14) 
[GCC 4.7.2] on linux2
Type <span style="color: #ffa07a;">"help"</span>, <span style="color: #ffa07a;">"copyright"</span>, <span style="color: #ffa07a;">"credits"</span> <span style="color: #00ffff;">or</span> <span style="color: #ffa07a;">"license"</span> <span style="color: #00ffff;">for</span> more information.
&gt;&gt;&gt; <span style="color: #00ffff;">import</span> ng_pod
&gt;&gt;&gt; <span style="color: #eedd82;">body</span> = ng_pod.fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)
&gt;&gt;&gt; <span style="color: #00ffff;">print</span> body
.
.
.
</pre>



<p>
   There will be a lot of output.
</p>
<p>
   This is fine but it would be nicer to directly run it from the
   command line rather than importing and manually running from the
   interpreter. If we do that however, we get no output. Try it
   <code>python ng_pod.py</code>. This is because the function is not actually
   called. We can fix that by sticking an invocation at the end like
   so
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> requests

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)

</pre>



<p>
   Now it will work fine but we can no longer import it without the
   fetch running which is annoying. To resolve this, the standard
   Python idiom is to have different behaviours when the module is
   imported and when it is run.
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> requests

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    <span style="color: #00ffff;">print</span> fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)

</pre>



<p>
  Python modules when imported will have a special variable
  automatically created called <code>__name__</code>. If the module was imported,
  this will have the name of module in it. If it was run, it will be
  <code>__main__</code>. We put a check for this and if imported, run the
  function.
</p>
<p>
  Now, if we run the module, it will actually do the fetching. If we
  import it, it won't do anything and will wait for us to call the
  function.
</p>

</div>
