online-workshops/python-14-Sep-2013/python-14-sep-2013.org
*** Explanations
    The =import= keyword allows us to use external libraries in our
    program. =import requests= makes the functions and objects defined
    in the =requests= library available to our program. It's
    namespaced so you'll have to call the functions using the
    =requests= prefix (like =requests.get= instead of just =get=). 

    The =def= keyword allows us to define functions. In this case, we
    define a function called =fetch_url= that takes one url. The
    string right below the function is called a *docstring*. It's the
    documentation for a function and can be accessed externally using
    =fetch_url.__doc__=. Also, the =pydoc= tool can automatically
    generate documentation for you using these strings.

    We call the =requests.get= method. This is function defined at the
    top level of the requests module. If someone imported our =ng_pod=
    module, they'd be able to call =ng_pod.fetch_url=. The method
    fetches the content from the URL and then returns the payload.

** Step 3.2 : Parse the document.
   
   If you look at the source of the document, you'll find an =img= tag
   inside a div called  =<div>= with  =class= =primary_photo=. This is
   what we want to get at. 
   
   Let's write another function to do this parsing.

#+BEGIN_SRC python
import requests
from bs4 import BeautifulSoup

def get_image_url(page):
    """
    Gets the image URL from the first img inside the <div
    class='primary_photo'> tag
    """

    soup = BeautifulSoup(page)
    div = soup.find('div', class_ = 'primary_photo')
    img = div.find('img')['src']
    return img


def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

if __name__ == "__main__":
    page = fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")
    image_url = get_image_url(page)
    print image_url
#+END_SRC   
*** Explanation
    The =from bs4 import BeautifulSoup= imports the =bs4= module
    (which is the name of the =BeautifulSoup= library) and then makes
    available the =BeautifulSoup= object that's defined inside it. We
    could just as well have done =import bs4= and then said
    =bs4.BeautifulSoup(page)= inside the =get_image= function.

    The =get_image_url= function takes the output of the =fetch_url=
    function and gets the URL of the image from it. It does this by
    first creating a =soup= object by instantiating the
    =BeautifulSoup= object. This looks like a function call but it's
    actually an object being created. The resulting =soup= object has
    methods to do various things. The =find= method can locate nodes
    in the document based on various criteria. We first search for all
    =div= elements with the =class= parameter equal to
    =primary_photo=. Then find the =img= inside that and get the =src=
    attribute of that tag which will be the URL to the image we want.

    You'll also notice the """ syntax in the docstring for the
    =get_image_url= function. This is Python's way of declaring a
    multi line string.

    We then return this URL.

** Step 3.3 : Get the image.
   We can reuse the =fetch_url= function to do this so we get

#+BEGIN_SRC python
  import requests
  from bs4 import BeautifulSoup
  
  def get_image_url(page):
      """
      Gets the image URL from the first img inside the <div
      class='primary_photo'> tag
      """
  
      soup = BeautifulSoup(page)
      div = soup.find('div', class_ = 'primary_photo')
      img = div.find('img')['src']
      return img
  
  def fetch_url(url):
      "Fetches the page with the given url and returns the body."
      r = requests.get(url)
      return r.content
  
  if __name__ == "__main__":
      page = fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")
      image_url = get_image_url(page)
      print image_url
      image = fetch_url(image_url)
      with open("image.jpg", "wb") as f:
          f.write(image)
  
#+END_SRC

*** Explanation
    We reuse our =fetch_url= function to fetch the image. The =with=
    which we use works by creating a *context* where some actions are
    done. When the context is left, the actions are automatically
    undone. In this case, the file =image.jpg= is opened in binary
    mode and then made available as =f=. We write the data we got from
    the website into this file. When we leave the block, the file
    automatically gets closed. We could have done this like so

#+BEGIN_SRC python
f = open("image.jpg", "wb")
f.write(image)
f.close()
#+END_SRC

    You can run this program once and then take a look at the
    image. It will be in your directory as =image.jpg=.

