online-workshops/python-14-Sep-2013/python-14-sep-2013.html

<div id="outline-container-5_1_1" class="outline-4">
<h4 id="sec-5_1_1"><span class="section-number-4">5.1.1</span> Explanations </h4>
<div class="outline-text-4" id="text-5_1_1">

<p>    The <code>import</code> keyword allows us to use external libraries in our
    program. <code>import requests</code> makes the functions and objects defined
    in the <code>requests</code> library available to our program. It's
    namespaced so you'll have to call the functions using the
    <code>requests</code> prefix (like <code>requests.get</code> instead of just <code>get</code>). 
</p>
<p>
    The <code>def</code> keyword allows us to define functions. In this case, we
    define a function called <code>fetch_url</code> that takes one url. The
    string right below the function is called a <b>docstring</b>. It's the
    documentation for a function and can be accessed externally using
    <code>fetch_url.__doc__</code>. Also, the <code>pydoc</code> tool can automatically
    generate documentation for you using these strings.
</p>
<p>
    We call the <code>requests.get</code> method. This is function defined at the
    top level of the requests module. If someone imported our <code>ng_pod</code>
    module, they'd be able to call <code>ng_pod.fetch_url</code>. The method
    fetches the content from the URL and then returns the payload.
</p>
</div>
</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3">5.2</span> Step 3.2 : Parse the document. </h3>
<div class="outline-text-3" id="text-5_2">


<p>   
   If you look at the source of the document, you'll find an <code>img</code> tag
   inside a div called  <code>&lt;div&gt;</code> with  <code>class</code> <code>primary_photo</code>. This is
   what we want to get at. 
</p>
<p>   
   Let's write another function to do this parsing.
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> requests
<span style="color: #00ffff;">from</span> bs4 <span style="color: #00ffff;">import</span> BeautifulSoup

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_image_url</span>(page):
    <span style="color: #ffa07a;">"""
    Gets the image URL from the first img inside the &lt;div
    class='primary_photo'&gt; tag
    """</span>

    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">div</span> = soup.find(<span style="color: #ffa07a;">'div'</span>, class_ = <span style="color: #ffa07a;">'primary_photo'</span>)
    <span style="color: #eedd82;">img</span> = div.find(<span style="color: #ffa07a;">'img'</span>)[<span style="color: #ffa07a;">'src'</span>]
    <span style="color: #00ffff;">return</span> img


<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    page = fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)
    image_url = get_image_url(page)
    <span style="color: #00ffff;">print</span> image_url
</pre>



</div>

<div id="outline-container-5_2_1" class="outline-4">
<h4 id="sec-5_2_1"><span class="section-number-4">5.2.1</span> Explanation </h4>
<div class="outline-text-4" id="text-5_2_1">

<p>    The <code>from bs4 import BeautifulSoup</code> imports the <code>bs4</code> module
    (which is the name of the <code>BeautifulSoup</code> library) and then makes
    available the <code>BeautifulSoup</code> object that's defined inside it. We
    could just as well have done <code>import bs4</code> and then said
    <code>bs4.BeautifulSoup(page)</code> inside the <code>get_image</code> function.
</p>
<p>
    The <code>get_image_url</code> function takes the output of the <code>fetch_url</code>
    function and gets the URL of the image from it. It does this by
    first creating a <code>soup</code> object by instantiating the
    <code>BeautifulSoup</code> object. This looks like a function call but it's
    actually an object being created. The resulting <code>soup</code> object has
    methods to do various things. The <code>find</code> method can locate nodes
    in the document based on various criteria. We first search for all
    <code>div</code> elements with the <code>class</code> parameter equal to
    <code>primary_photo</code>. Then find the <code>img</code> inside that and get the <code>src</code>
    attribute of that tag which will be the URL to the image we want.
</p>
<p>
    You'll also notice the """ syntax in the docstring for the
    <code>get_image_url</code> function. This is Python's way of declaring a
    multi line string.
</p>
<p>
    We then return this URL.
</p>
</div>
</div>

</div>

<div id="outline-container-5_3" class="outline-3">
<h3 id="sec-5_3"><span class="section-number-3">5.3</span> Step 3.3 : Get the image. </h3>
<div class="outline-text-3" id="text-5_3">

<p>   We can reuse the <code>fetch_url</code> function to do this so we get
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> requests
<span style="color: #00ffff;">from</span> bs4 <span style="color: #00ffff;">import</span> BeautifulSoup

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_image_url</span>(page):
    <span style="color: #ffa07a;">"""
    Gets the image URL from the first img inside the &lt;div
    class='primary_photo'&gt; tag
    """</span>

    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">div</span> = soup.find(<span style="color: #ffa07a;">'div'</span>, class_ = <span style="color: #ffa07a;">'primary_photo'</span>)
    <span style="color: #eedd82;">img</span> = div.find(<span style="color: #ffa07a;">'img'</span>)[<span style="color: #ffa07a;">'src'</span>]
    <span style="color: #00ffff;">return</span> img

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    page = fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)
    image_url = get_image_url(page)
    <span style="color: #00ffff;">print</span> image_url
    image = fetch_url(image_url)
    <span style="color: #00ffff;">with</span> <span style="color: #b0c4de;">open</span>(<span style="color: #ffa07a;">"image.jpg"</span>, <span style="color: #ffa07a;">"wb"</span>) <span style="color: #00ffff;">as</span> f:
        f.write(image)

</pre>




</div>

<div id="outline-container-5_3_1" class="outline-4">
<h4 id="sec-5_3_1"><span class="section-number-4">5.3.1</span> Explanation </h4>
<div class="outline-text-4" id="text-5_3_1">

<p>    We reuse our <code>fetch_url</code> function to fetch the image. The <code>with</code>
    which we use works by creating a <b>context</b> where some actions are
    done. When the context is left, the actions are automatically
    undone. In this case, the file <code>image.jpg</code> is opened in binary
    mode and then made available as <code>f</code>. We write the data we got from
    the website into this file. When we leave the block, the file
    automatically gets closed. We could have done this like so
</p>



<pre class="src src-python"><span style="color: #eedd82;">f</span> = <span style="color: #b0c4de;">open</span>(<span style="color: #ffa07a;">"image.jpg"</span>, <span style="color: #ffa07a;">"wb"</span>)
f.write(image)
f.close()
</pre>



<p>
    You can run this program once and then take a look at the
    image. It will be in your directory as <code>image.jpg</code>.
</p>
</div>
</div>

</div>
