online-workshops/python-14-Sep-2013/python-14-sep-2013.org
** Step 3.4 : Set the background
   
   We have to "shell out" to actually set the background. The =qiv=
   program can set backgrounds like so =qiv --root_s image_file= 

   We add a new function to our program so that it now looks like this

#+BEGIN_SRC python
import subprocess

import requests
from bs4 import BeautifulSoup

def get_image_url(page):
    """
    Gets the image URL from the first img inside the <div
    class='primary_photo'> tag
    """

    soup = BeautifulSoup(page)
    div = soup.find('div', class_ = 'primary_photo')
    img = div.find('img')['src']
    return img

def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

def set_desktop_background(image_file):
    "Sets the desktop background to the file image_file."
    command = "qiv --root_s %s"%image_file
    print command
    cmd_list = command.split()
    subprocess.call(cmd_list)
    

if __name__ == "__main__":
    page = fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")
    image_url = get_image_url(page)
    print image_url
    image = fetch_url(image_url)
    with open("image.jpg", "wb") as f:
        f.write(image)
    set_desktop_background("image.jpg")

#+END_SRC
*** Explanation
    Now we have to actually set the background. For this, we can use
    the =qiv= program. We use the =subprocess= module to call external
    programs in Python. 

    First we make a new function called =set_desktop_background=. In
    it, we first construct a =command=. This simply creates a command
    like =qiv --root_s image.jpg=. We use string interpolation to do
    this. In general, we can put format specifiers inside a string
    using =%= and then, after the string, use =%= to specify
    values. For example

#+BEGIN_SRC python

name = "Noor"
age = 30
place = "Bangalore"

print "%s aged %d from %s"%(name, age, place)

#+END_SRC

    would print =Noor aged 30 from Bangalore=.  Once we get the
    command, we print it once and then call the =split= method on the
    string. This will break it up into a list of string. Each "word"
    will become a separate element of the list. In the following
    example

#+BEGIN_SRC python
snippet = "Eternity in an hour"

print snippet.split()
#+END_SRC

    Would give you =['Eternity', 'in', 'an', 'hour']=. We need it in
    this fashion because =subprocess.call= expects the command that
    way. We call it. 

** Step 3.5 : Add a main function.
   
   The program works now but it's not good style to put so much code
   out under the =if=. Let's move it to a function and return
   something to the OS.

   =main= is not reserved in any way (like in C) or even a
   convention. I'm just calling it that. 

#+BEGIN_SRC python
import subprocess
import sys

import requests
from bs4 import BeautifulSoup

def get_image_url(page):
    """
    Gets the image URL from the first img inside the <div
    class='primary_photo'> tag
    """

    soup = BeautifulSoup(page)
    div = soup.find('div', class_ = 'primary_photo')
    img = div.find('img')['src']
    return img

def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

def set_desktop_background(image_file):
    "Sets the desktop background to the file image_file."
    command = "qiv --root_s %s"%image_file
    print command
    cmd_list = command.split()
    subprocess.call(cmd_list)

def main():
    page = fetch_url("http://photography.nationalgeographic.com/photography/photo-of-the-day/")
    image_url = get_image_url(page)
    print image_url
    image = fetch_url(image_url)
    with open("image.jpg", "wb") as f:
        f.write(image)
    set_desktop_background("image.jpg")
    return 0

if __name__ == "__main__":
    sys.exit(main())


#+END_SRC

   
*** Explanation
    The =sys= module is part of the standard library (just as
    =subprocess= is) and it contains system functions. The =exit=
    function to quit the interpreter and return a value to the OS is
    inside this.
    
    We call main and pass its return value to =sys.exit= in the =if=
    part of the code. 

    The main function itself contains everything which was originally
    outside and we add a =return= to return something if everything is
    okay.
