online-workshops/python-14-Sep-2013/python-14-sep-2013.html

<div id="outline-container-5_4" class="outline-3">
<h3 id="sec-5_4"><span class="section-number-3">5.4</span> Step 3.4 : Set the background </h3>
<div class="outline-text-3" id="text-5_4">


<p>   
   We have to "shell out" to actually set the background. The <code>qiv</code>
   program can set backgrounds like so <code>qiv --root_s image_file</code> 
</p>
<p>
   We add a new function to our program so that it now looks like this
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> subprocess

<span style="color: #00ffff;">import</span> requests
<span style="color: #00ffff;">from</span> bs4 <span style="color: #00ffff;">import</span> BeautifulSoup

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_image_url</span>(page):
    <span style="color: #ffa07a;">"""
    Gets the image URL from the first img inside the &lt;div
    class='primary_photo'&gt; tag
    """</span>

    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">div</span> = soup.find(<span style="color: #ffa07a;">'div'</span>, class_ = <span style="color: #ffa07a;">'primary_photo'</span>)
    <span style="color: #eedd82;">img</span> = div.find(<span style="color: #ffa07a;">'img'</span>)[<span style="color: #ffa07a;">'src'</span>]
    <span style="color: #00ffff;">return</span> img

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">set_desktop_background</span>(image_file):
    <span style="color: #ffa07a;">"Sets the desktop background to the file image_file."</span>
    <span style="color: #eedd82;">command</span> = <span style="color: #ffa07a;">"qiv --root_s %s"</span>%image_file
    <span style="color: #00ffff;">print</span> command
    <span style="color: #eedd82;">cmd_list</span> = command.split()
    subprocess.call(cmd_list)
    

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    page = fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)
    image_url = get_image_url(page)
    <span style="color: #00ffff;">print</span> image_url
    image = fetch_url(image_url)
    <span style="color: #00ffff;">with</span> <span style="color: #b0c4de;">open</span>(<span style="color: #ffa07a;">"image.jpg"</span>, <span style="color: #ffa07a;">"wb"</span>) <span style="color: #00ffff;">as</span> f:
        f.write(image)
    set_desktop_background(<span style="color: #ffa07a;">"image.jpg"</span>)

</pre>



</div>

<div id="outline-container-5_4_1" class="outline-4">
<h4 id="sec-5_4_1"><span class="section-number-4">5.4.1</span> Explanation </h4>
<div class="outline-text-4" id="text-5_4_1">

<p>    Now we have to actually set the background. For this, we can use
    the <code>qiv</code> program. We use the <code>subprocess</code> module to call external
    programs in Python. 
</p>
<p>
    First we make a new function called <code>set_desktop_background</code>. In
    it, we first construct a <code>command</code>. This simply creates a command
    like <code>qiv --root_s image.jpg</code>. We use string interpolation to do
    this. In general, we can put format specifiers inside a string
    using <code>%</code> and then, after the string, use <code>%</code> to specify
    values. For example
</p>



<pre class="src src-python"><span style="color: #eedd82;">name</span> = <span style="color: #ffa07a;">"Noor"</span>
<span style="color: #eedd82;">age</span> = 30
<span style="color: #eedd82;">place</span> = <span style="color: #ffa07a;">"Bangalore"</span>

<span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">"%s aged %d from %s"</span>%(name, age, place)

</pre>



<p>
    would print <code>Noor aged 30 from Bangalore</code>.  Once we get the
    command, we print it once and then call the <code>split</code> method on the
    string. This will break it up into a list of string. Each "word"
    will become a separate element of the list. In the following
    example
</p>



<pre class="src src-python"><span style="color: #eedd82;">snippet</span> = <span style="color: #ffa07a;">"Eternity in an hour"</span>

<span style="color: #00ffff;">print</span> snippet.split()
</pre>



<p>
    Would give you <code>['Eternity', 'in', 'an', 'hour']</code>. We need it in
    this fashion because <code>subprocess.call</code> expects the command that
    way. We call it. 
</p>
</div>
</div>

</div>

<div id="outline-container-5_5" class="outline-3">
<h3 id="sec-5_5"><span class="section-number-3">5.5</span> Step 3.5 : Add a main function. </h3>
<div class="outline-text-3" id="text-5_5">


<p>   
   The program works now but it's not good style to put so much code
   out under the <code>if</code>. Let's move it to a function and return
   something to the OS.
</p>
<p>
   <code>main</code> is not reserved in any way (like in C) or even a
   convention. I'm just calling it that. 
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> subprocess
<span style="color: #00ffff;">import</span> sys

<span style="color: #00ffff;">import</span> requests
<span style="color: #00ffff;">from</span> bs4 <span style="color: #00ffff;">import</span> BeautifulSoup

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_image_url</span>(page):
    <span style="color: #ffa07a;">"""
    Gets the image URL from the first img inside the &lt;div
    class='primary_photo'&gt; tag
    """</span>

    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">div</span> = soup.find(<span style="color: #ffa07a;">'div'</span>, class_ = <span style="color: #ffa07a;">'primary_photo'</span>)
    <span style="color: #eedd82;">img</span> = div.find(<span style="color: #ffa07a;">'img'</span>)[<span style="color: #ffa07a;">'src'</span>]
    <span style="color: #00ffff;">return</span> img

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">set_desktop_background</span>(image_file):
    <span style="color: #ffa07a;">"Sets the desktop background to the file image_file."</span>
    <span style="color: #eedd82;">command</span> = <span style="color: #ffa07a;">"qiv --root_s %s"</span>%image_file
    <span style="color: #00ffff;">print</span> command
    <span style="color: #eedd82;">cmd_list</span> = command.split()
    subprocess.call(cmd_list)

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">main</span>():
    <span style="color: #eedd82;">page</span> = fetch_url(<span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>)
    <span style="color: #eedd82;">image_url</span> = get_image_url(page)
    <span style="color: #00ffff;">print</span> image_url
    <span style="color: #eedd82;">image</span> = fetch_url(image_url)
    <span style="color: #00ffff;">with</span> <span style="color: #b0c4de;">open</span>(<span style="color: #ffa07a;">"image.jpg"</span>, <span style="color: #ffa07a;">"wb"</span>) <span style="color: #00ffff;">as</span> f:
        f.write(image)
    set_desktop_background(<span style="color: #ffa07a;">"image.jpg"</span>)
    <span style="color: #00ffff;">return</span> 0

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    sys.<span style="color: #7fffd4;">exit</span>(main())


</pre>





</div>

<div id="outline-container-5_5_1" class="outline-4">
<h4 id="sec-5_5_1"><span class="section-number-4">5.5.1</span> Explanation </h4>
<div class="outline-text-4" id="text-5_5_1">

<p>    The <code>sys</code> module is part of the standard library (just as
    <code>subprocess</code> is) and it contains system functions. The <code>exit</code>
    function to quit the interpreter and return a value to the OS is
    inside this.
</p>
<p>    
    We call main and pass its return value to <code>sys.exit</code> in the <code>if</code>
    part of the code. 
</p>
<p>
    The main function itself contains everything which was originally
    outside and we add a <code>return</code> to return something if everything is
    okay.
</p></div>
</div>
</div>

</div>
