online-workshops/python-14-Sep-2013/python-14-sep-2013.org
* Enhancement 1 : Add code to get previous images
  The page has a "Previous" link. We can use that to go to the
  previous days image and download that.

  We can specify a number as an argument to the program which tells it
  how far back we have to go. So if we say =python ng_pod.py 2= it
  will go back two days and fetch the image from there.

  The =a= tag inside the =p= tag with class =prev= has the URL we want
  but it's relative and we need to fix that.

  We should keep the URL base and combine it with that. The
  combination is done intelligently using the =urlparse= module that's
  in the standard library.

#+BEGIN_SRC python

import subprocess
import sys
import urlparse

import requests
from bs4 import BeautifulSoup

BASE_URL = "http://photography.nationalgeographic.com/photography/photo-of-the-day/"

def get_previous_day_url(page):
    "Gets the URL for the previous day from the page"
    
    soup = BeautifulSoup(page)
    p = soup.find('p', class_ = 'prev')
    rel_prev_url = p.find('a')['href']
    abs_prev_url = urlparse.urljoin(BASE_URL, rel_prev_url)
    return abs_prev_url

def get_image_url(page):
    """
    Gets the image URL from the first img inside the <div
    class='primary_photo'> tag
    """

    soup = BeautifulSoup(page)
    div = soup.find('div', class_ = 'primary_photo')
    img = div.find('img')['src']
    return img

def fetch_url(url):
    "Fetches the page with the given url and returns the body."
    r = requests.get(url)
    return r.content

def set_desktop_background(image_file):
    "Sets the desktop background to the file image_file."
    command = "qiv --root_s %s"%image_file
    print command
    cmd_list = command.split()
    subprocess.call(cmd_list)

def main():
    page = fetch_url(get_previous_day_url(fetch_url(BASE_URL)))
    image_url = get_image_url(page)
    print image_url
    image = fetch_url(image_url)
    with open("image.jpg", "wb") as f:
        f.write(image)
    set_desktop_background("image.jpg")
    return 0

if __name__ == "__main__":
    sys.exit(main())

#+END_SRC

  All this logic is inside the =get_previous_day_url= function. It's
  quite similar to the. =get_image_url= we wrote earlier. We also
  change the =main= function to get the image for the previous day
  just to test it and it works fine.

  

  

  
* Enhancement 2 : Add command line arguments
  Next, we need to add a command line argument to specify how far back
  we want to go. Something like =python ng_pod.py -d 5= will give us
  the picture from 5 days ago.

  The Python standard library gives us the =argparse= module to take
  care of this.

#+BEGIN_SRC python
  import argparse
  import subprocess
  import sys
  import urlparse
  
  import requests
  from bs4 import BeautifulSoup
  
  BASE_URL = "http://photography.nationalgeographic.com/photography/photo-of-the-day/"
  
  def parse_args(args):
      parser = argparse.ArgumentParser(description='Nat Geo picture of the day grabber.')
      parser.add_argument('-d', '--days', type=int, default = 0, help='Get pic for these many days ago')
      return parser.parse_args(sys.argv[1:])
  
  def get_day_url(days):
      page = fetch_url(BASE_URL)
      for i in range(days):
          print "Day %d"%i
          page = fetch_url(get_previous_day_url(page))
      return page
  
  def get_previous_day_url(page):
      "Gets the URL for the previous day from the page"
      
      soup = BeautifulSoup(page)
      p = soup.find('p', class_ = 'prev')
      rel_prev_url = p.find('a')['href']
      abs_prev_url = urlparse.urljoin(BASE_URL, rel_prev_url)
      return abs_prev_url
  
  def get_image_url(page):
      """
      Gets the image URL from the first img inside the <div
      class='primary_photo'> tag
      """
  
      soup = BeautifulSoup(page)
      div = soup.find('div', class_ = 'primary_photo')
      img = div.find('img')['src']
      return img
  
  def fetch_url(url):
      "Fetches the page with the given url and returns the body."
      r = requests.get(url)
      return r.content
  
  def set_desktop_background(image_file):
      "Sets the desktop background to the file image_file."
      command = "qiv --root_s %s"%image_file
      print command
      cmd_list = command.split()
      subprocess.call(cmd_list)
  
  def main():
      args = parse_args(sys.argv)
      page = get_day_url(args.days)
      image_url = get_image_url(page)
      image = fetch_url(image_url)
      with open("image.jpg", "wb") as f:
          f.write(image)
      set_desktop_background("image.jpg")
      return 0
  
  if __name__ == "__main__":
      sys.exit(main())
#+END_SRC  

