online-workshops/python-14-Sep-2013/python-14-sep-2013.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Enhancement 1 : Add code to get previous images </h2>
<div class="outline-text-2" id="text-6">

<p>  The page has a "Previous" link. We can use that to go to the
  previous days image and download that.
</p>
<p>
  We can specify a number as an argument to the program which tells it
  how far back we have to go. So if we say <code>python ng_pod.py 2</code> it
  will go back two days and fetch the image from there.
</p>
<p>
  The <code>a</code> tag inside the <code>p</code> tag with class <code>prev</code> has the URL we want
  but it's relative and we need to fix that.
</p>
<p>
  We should keep the URL base and combine it with that. The
  combination is done intelligently using the <code>urlparse</code> module that's
  in the standard library.
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> subprocess
<span style="color: #00ffff;">import</span> sys
<span style="color: #00ffff;">import</span> urlparse

<span style="color: #00ffff;">import</span> requests
<span style="color: #00ffff;">from</span> bs4 <span style="color: #00ffff;">import</span> BeautifulSoup

<span style="color: #eedd82;">BASE_URL</span> = <span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_previous_day_url</span>(page):
    <span style="color: #ffa07a;">"Gets the URL for the previous day from the page"</span>
    
    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">p</span> = soup.find(<span style="color: #ffa07a;">'p'</span>, class_ = <span style="color: #ffa07a;">'prev'</span>)
    <span style="color: #eedd82;">rel_prev_url</span> = p.find(<span style="color: #ffa07a;">'a'</span>)[<span style="color: #ffa07a;">'href'</span>]
    <span style="color: #eedd82;">abs_prev_url</span> = urlparse.urljoin(BASE_URL, rel_prev_url)
    <span style="color: #00ffff;">return</span> abs_prev_url

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_image_url</span>(page):
    <span style="color: #ffa07a;">"""
    Gets the image URL from the first img inside the &lt;div
    class='primary_photo'&gt; tag
    """</span>

    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">div</span> = soup.find(<span style="color: #ffa07a;">'div'</span>, class_ = <span style="color: #ffa07a;">'primary_photo'</span>)
    <span style="color: #eedd82;">img</span> = div.find(<span style="color: #ffa07a;">'img'</span>)[<span style="color: #ffa07a;">'src'</span>]
    <span style="color: #00ffff;">return</span> img

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">set_desktop_background</span>(image_file):
    <span style="color: #ffa07a;">"Sets the desktop background to the file image_file."</span>
    <span style="color: #eedd82;">command</span> = <span style="color: #ffa07a;">"qiv --root_s %s"</span>%image_file
    <span style="color: #00ffff;">print</span> command
    <span style="color: #eedd82;">cmd_list</span> = command.split()
    subprocess.call(cmd_list)

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">main</span>():
    <span style="color: #eedd82;">page</span> = fetch_url(get_previous_day_url(fetch_url(BASE_URL)))
    <span style="color: #eedd82;">image_url</span> = get_image_url(page)
    <span style="color: #00ffff;">print</span> image_url
    <span style="color: #eedd82;">image</span> = fetch_url(image_url)
    <span style="color: #00ffff;">with</span> <span style="color: #b0c4de;">open</span>(<span style="color: #ffa07a;">"image.jpg"</span>, <span style="color: #ffa07a;">"wb"</span>) <span style="color: #00ffff;">as</span> f:
        f.write(image)
    set_desktop_background(<span style="color: #ffa07a;">"image.jpg"</span>)
    <span style="color: #00ffff;">return</span> 0

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    sys.<span style="color: #7fffd4;">exit</span>(main())

</pre>



<p>
  All this logic is inside the <code>get_previous_day_url</code> function. It's
  quite similar to the. <code>get_image_url</code> we wrote earlier. We also
  change the <code>main</code> function to get the image for the previous day
  just to test it and it works fine.
</p>





</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Enhancement 2 : Add command line arguments </h2>
<div class="outline-text-2" id="text-7">

<p>  Next, we need to add a command line argument to specify how far back
  we want to go. Something like <code>python ng_pod.py -d 5</code> will give us
  the picture from 5 days ago.
</p>
<p>
  The Python standard library gives us the <code>argparse</code> module to take
  care of this.
</p>



<pre class="src src-python"><span style="color: #00ffff;">import</span> argparse
<span style="color: #00ffff;">import</span> subprocess
<span style="color: #00ffff;">import</span> sys
<span style="color: #00ffff;">import</span> urlparse

<span style="color: #00ffff;">import</span> requests
<span style="color: #00ffff;">from</span> bs4 <span style="color: #00ffff;">import</span> BeautifulSoup

<span style="color: #eedd82;">BASE_URL</span> = <span style="color: #ffa07a;">"http://photography.nationalgeographic.com/photography/photo-of-the-day/"</span>

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">parse_args</span>(args):
    <span style="color: #eedd82;">parser</span> = argparse.ArgumentParser(description=<span style="color: #ffa07a;">'Nat Geo picture of the day grabber.'</span>)
    parser.add_argument(<span style="color: #ffa07a;">'-d'</span>, <span style="color: #ffa07a;">'--days'</span>, <span style="color: #b0c4de;">type</span>=<span style="color: #b0c4de;">int</span>, default = 0, <span style="color: #b0c4de;">help</span>=<span style="color: #ffa07a;">'Get pic for these many days ago'</span>)
    <span style="color: #00ffff;">return</span> parser.parse_args(sys.argv[1:])

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_day_url</span>(days):
    <span style="color: #eedd82;">page</span> = fetch_url(BASE_URL)
    <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(days):
        <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">"Day %d"</span>%i
        <span style="color: #eedd82;">page</span> = fetch_url(get_previous_day_url(page))
    <span style="color: #00ffff;">return</span> page

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_previous_day_url</span>(page):
    <span style="color: #ffa07a;">"Gets the URL for the previous day from the page"</span>
    
    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">p</span> = soup.find(<span style="color: #ffa07a;">'p'</span>, class_ = <span style="color: #ffa07a;">'prev'</span>)
    <span style="color: #eedd82;">rel_prev_url</span> = p.find(<span style="color: #ffa07a;">'a'</span>)[<span style="color: #ffa07a;">'href'</span>]
    <span style="color: #eedd82;">abs_prev_url</span> = urlparse.urljoin(BASE_URL, rel_prev_url)
    <span style="color: #00ffff;">return</span> abs_prev_url

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">get_image_url</span>(page):
    <span style="color: #ffa07a;">"""
    Gets the image URL from the first img inside the &lt;div
    class='primary_photo'&gt; tag
    """</span>

    <span style="color: #eedd82;">soup</span> = BeautifulSoup(page)
    <span style="color: #eedd82;">div</span> = soup.find(<span style="color: #ffa07a;">'div'</span>, class_ = <span style="color: #ffa07a;">'primary_photo'</span>)
    <span style="color: #eedd82;">img</span> = div.find(<span style="color: #ffa07a;">'img'</span>)[<span style="color: #ffa07a;">'src'</span>]
    <span style="color: #00ffff;">return</span> img

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">fetch_url</span>(url):
    <span style="color: #ffa07a;">"Fetches the page with the given url and returns the body."</span>
    <span style="color: #eedd82;">r</span> = requests.get(url)
    <span style="color: #00ffff;">return</span> r.content

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">set_desktop_background</span>(image_file):
    <span style="color: #ffa07a;">"Sets the desktop background to the file image_file."</span>
    <span style="color: #eedd82;">command</span> = <span style="color: #ffa07a;">"qiv --root_s %s"</span>%image_file
    <span style="color: #00ffff;">print</span> command
    <span style="color: #eedd82;">cmd_list</span> = command.split()
    subprocess.call(cmd_list)

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">main</span>():
    <span style="color: #eedd82;">args</span> = parse_args(sys.argv)
    <span style="color: #eedd82;">page</span> = get_day_url(args.days)
    <span style="color: #eedd82;">image_url</span> = get_image_url(page)
    <span style="color: #eedd82;">image</span> = fetch_url(image_url)
    <span style="color: #00ffff;">with</span> <span style="color: #b0c4de;">open</span>(<span style="color: #ffa07a;">"image.jpg"</span>, <span style="color: #ffa07a;">"wb"</span>) <span style="color: #00ffff;">as</span> f:
        f.write(image)
    set_desktop_background(<span style="color: #ffa07a;">"image.jpg"</span>)
    <span style="color: #00ffff;">return</span> 0

<span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    sys.<span style="color: #7fffd4;">exit</span>(main())
</pre>




</div>
