online-workshops/python-14-Sep-2013/python-14-sep-2013.org
** Explanation
   We write the =parse_args= function to take care of the argument
   handling. The =argparse= module in the standard library takes care
   argument parsing. We create an =ArgumentParser= object with the
   appropriate description and then add the =-d= option to it. After
   that we parse the arguments.

   The =argv= variable inside the =sys= module contains the command
   line which was run to get the program. If we run 
   =python /home/guest/project/ng_pod.py -d 18=, =sys.argv= will contain
   =['/home/guest/project/ng_pod.py', '-d', '18']=. 
   
   This is a Python =list=. Lists are similar to arrays in C but they
   can grow dynamically and have some methods that are useful. With a
   list like =lst = ['This', 'is', 'a', 'python', 'program']=, you can
   do the following

#+BEGIN_SRC python
>>> lst[1:4]
['is', 'a', 'python']
>>> lst[1:4] # Items from index 1 upto 4
['is', 'a', 'python']
>>> lst[1:] # Elements from the first onwards (exclude 0th)
['is', 'a', 'python', 'program']
>>> lst[:4] # Items upto the 4th
['This', 'is', 'a', 'python']
>>> lst[0:5:1] # Every second item (the last 1 is a step)
['This', 'is', 'a', 'python', 'program']
>>> lst[0:5:2] # Every second item (the last 1 is a step)
['This', 'a', 'program']
>>> lst[-1] # The first element from the end of the list
'program'
>>> lst[-3:-1] # Elements from the third last till the last
['a', 'python']
>>> 
#+END_SRC

So we give the =parse_args= method of the =parser= object all the
arguments from our program. We skip the first element since it's the
name of the program itself. It will return the value of =-d=. If we
don't specify it, we'll get zero.

We call this function inside =main= and then pass the =days= parameter
to the =get_day_url= function. Here, we first fetch the latest page
and then start a loop. 

Python uses =for= for definite iteration (usually over some kind of
iterable like a list) and =while= for indefinite iteration (e.g. loop
till a condition is satisfied). The =range= function gives you a list
of numbers till the argument. So,

#+BEGIN_SRC python 
>>> range(10)
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

>>> for i in range(10):
...   print "%d x 5 = %d"%(i, i * 5)
... 
0 x 5 = 0
1 x 5 = 5
2 x 5 = 10
3 x 5 = 15
4 x 5 = 20
5 x 5 = 25
6 x 5 = 30
7 x 5 = 35
8 x 5 = 40
9 x 5 = 45
#+END_SRC

We loop =days= times and each time get the page for the previous
day. When we're done, we return the last fetched URL. 

This then goes through the previous flow. 




* Homework
  Try the following
** Homework 1 
   Change the program to automatically change the background image
   once in 60 minutes. 

   This will require the =sleep= function in the standard library
   =time= module and you can put the entire program inside a
   =while True=. You'll also need to add a command line argument like
   =-c= (for continuous) to get this behaviour.
** Homework 2
   Change the program to download all the images for the past =n= days
   into the current directory named by date. If you run 
   =python ng_pod.py --download -d 10=, you should get 10 images in
   the current directory. 

** Homework 3
   Write a new program with similar log to parse and download all
   links from an image gallery. Here is an example
   http://www.glamsham.com/picture-gallery/aamir-khan-gallery/2493/1/celeb.htm


