online-workshops/python-14-Sep-2013/python-14-sep-2013.html

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Explanation </h3>
<div class="outline-text-3" id="text-7_1">

<p>   We write the <code>parse_args</code> function to take care of the argument
   handling. The <code>argparse</code> module in the standard library takes care
   argument parsing. We create an <code>ArgumentParser</code> object with the
   appropriate description and then add the <code>-d</code> option to it. After
   that we parse the arguments.
</p>
<p>
   The <code>argv</code> variable inside the <code>sys</code> module contains the command
   line which was run to get the program. If we run 
   <code>python /home/guest/project/ng_pod.py -d 18</code>, <code>sys.argv</code> will contain
   <code>['/home/guest/project/ng_pod.py', '-d', '18']</code>. 
</p>
<p>   
   This is a Python <code>list</code>. Lists are similar to arrays in C but they
   can grow dynamically and have some methods that are useful. With a
   list like <code>lst = ['This', 'is', 'a', 'python', 'program']</code>, you can
   do the following
</p>



<pre class="src src-python">&gt;&gt;&gt; lst[1:4]
[<span style="color: #ffa07a;">'is'</span>, <span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'python'</span>]
&gt;&gt;&gt; lst[1:4] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Items from index 1 upto 4
</span>[<span style="color: #ffa07a;">'is'</span>, <span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'python'</span>]
&gt;&gt;&gt; lst[1:] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Elements from the first onwards (exclude 0th)
</span>[<span style="color: #ffa07a;">'is'</span>, <span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'python'</span>, <span style="color: #ffa07a;">'program'</span>]
&gt;&gt;&gt; lst[:4] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Items upto the 4th
</span>[<span style="color: #ffa07a;">'This'</span>, <span style="color: #ffa07a;">'is'</span>, <span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'python'</span>]
&gt;&gt;&gt; lst[0:5:1] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Every second item (the last 1 is a step)
</span>[<span style="color: #ffa07a;">'This'</span>, <span style="color: #ffa07a;">'is'</span>, <span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'python'</span>, <span style="color: #ffa07a;">'program'</span>]
&gt;&gt;&gt; lst[0:5:2] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Every second item (the last 1 is a step)
</span>[<span style="color: #ffa07a;">'This'</span>, <span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'program'</span>]
&gt;&gt;&gt; lst[-1] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">The first element from the end of the list
</span><span style="color: #ffa07a;">'program'</span>
&gt;&gt;&gt; lst[-3:-1] <span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Elements from the third last till the last
</span>[<span style="color: #ffa07a;">'a'</span>, <span style="color: #ffa07a;">'python'</span>]
&gt;&gt;&gt; 
</pre>



<p>
So we give the <code>parse_args</code> method of the <code>parser</code> object all the
arguments from our program. We skip the first element since it's the
name of the program itself. It will return the value of <code>-d</code>. If we
don't specify it, we'll get zero.
</p>
<p>
We call this function inside <code>main</code> and then pass the <code>days</code> parameter
to the <code>get_day_url</code> function. Here, we first fetch the latest page
and then start a loop. 
</p>
<p>
Python uses <code>for</code> for definite iteration (usually over some kind of
iterable like a list) and <code>while</code> for indefinite iteration (e.g. loop
till a condition is satisfied). The <code>range</code> function gives you a list
of numbers till the argument. So,
</p>



<pre class="src src-python">&gt;&gt;&gt; <span style="color: #b0c4de;">range</span>(10)
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

&gt;&gt;&gt; <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(10):
...   <span style="color: #00ffff;">print</span> <span style="color: #ffa07a;">"%d x 5 = %d"</span>%(i, i * 5)
... 
0 x <span style="color: #eedd82;">5</span> = 0
1 x <span style="color: #eedd82;">5</span> = 5
2 x <span style="color: #eedd82;">5</span> = 10
3 x <span style="color: #eedd82;">5</span> = 15
4 x <span style="color: #eedd82;">5</span> = 20
5 x <span style="color: #eedd82;">5</span> = 25
6 x <span style="color: #eedd82;">5</span> = 30
7 x <span style="color: #eedd82;">5</span> = 35
8 x <span style="color: #eedd82;">5</span> = 40
9 x <span style="color: #eedd82;">5</span> = 45
</pre>



<p>
We loop <code>days</code> times and each time get the page for the previous
day. When we're done, we return the last fetched URL. 
</p>
<p>
This then goes through the previous flow. 
</p>



</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Homework </h2>
<div class="outline-text-2" id="text-8">

<p>  Try the following
</p>
</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> Homework 1 </h3>
<div class="outline-text-3" id="text-8_1">

<p>   Change the program to automatically change the background image
   once in 60 minutes. 
</p>
<p>
   This will require the <code>sleep</code> function in the standard library
   <code>time</code> module and you can put the entire program inside a
   <code>while True</code>. You'll also need to add a command line argument like
   <code>-c</code> (for continuous) to get this behaviour.
</p></div>

</div>

<div id="outline-container-8_2" class="outline-3">
<h3 id="sec-8_2"><span class="section-number-3">8.2</span> Homework 2 </h3>
<div class="outline-text-3" id="text-8_2">

<p>   Change the program to download all the images for the past <code>n</code> days
   into the current directory named by date. If you run 
   <code>python ng_pod.py --download -d 10</code>, you should get 10 images in
   the current directory. 
</p>
</div>

</div>

<div id="outline-container-8_3" class="outline-3">
<h3 id="sec-8_3"><span class="section-number-3">8.3</span> Homework 3 </h3>
<div class="outline-text-3" id="text-8_3">

<p>   Write a new program with similar log to parse and download all
   links from an image gallery. Here is an example
   <a href="http://www.glamsham.com/picture-gallery/aamir-khan-gallery/2493/1/celeb.htm">http://www.glamsham.com/picture-gallery/aamir-khan-gallery/2493/1/celeb.htm</a>
</p>

</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Class transcript </h2>
<div class="outline-text-2" id="text-9">

<p>  This workshop was concluded on 14/Sep/2013 at 1854 IST. The IRC transcript is available <a href="./python-14-sep-2013-transcript.html">here</a>.
</p></div>
</div>
<div id="postamble">
<p class="author">Author: Noufal Ibrahim <noufal@thelycaeum.in></p>
<p class="creator">Org version 7.5 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
